Revit 2024 API
ProjectInfo.BuildingName Property
Get or Set the Building Name of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string BuildingName { get; set; }
Visual Basic
Public Property BuildingName As String
	Get
	Set
Visual C++
public:
property String^ BuildingName {
	String^ get ();
	void set (String^ value);
}
Remarks
This property is used to get or set the Project Number of the Project Information.
See Also
ProjectInfo Class
Autodesk.Revit.DB Namespace